УправлениеВзаимоотношениямиСПартнерами/src/Documents/Любовь/Любовь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Любовь</name>
  <registerRecords>InformationRegister.ЛюбовьДляЖенщины</registerRecords>
  <registerRecords>InformationRegister.ЛюбовьДляМужчины</registerRecords>
  <attributes>
    <name>Мужчина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыЛюбовнойСвязи</types>
    </type>
  </attributes>
  <attributes>
    <name>Женщина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </attributes>
  <attributes>
    <name>Подробности</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

УправлениеВзаимоотношениямиСПартнерами/src/InformationRegisters/ЛюбовьДляЖенщины/ЛюбовьДляЖенщины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛюбовьДляЖенщины</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыЛюбовнойСвязи</types>
    </type>
  </resources>
  <resources>
    <name>Мужчина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </resources>
  <dimensions>
    <name>Женщина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВзаимоотношениямиСПартнерами/src/InformationRegisters/ЛюбовьДляМужчины/ЛюбовьДляМужчины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛюбовьДляМужчины</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВидСвязи</name>
    <type>
      <types>EnumRef.ВидыЛюбовнойСвязи</types>
    </type>
  </resources>
  <resources>
    <name>Женщина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </resources>
  <dimensions>
    <name>Мужчина</name>
    <type>
      <types>CatalogRef.Люди</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УправлениеВзаимоотношениямиСПартнерами/src/Documents/Любовь/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЛюбовьДляЖенщины
	Движения.ЛюбовьДляЖенщины.Записывать = Истина;
	Движение = Движения.ЛюбовьДляЖенщины.Добавить();
	Движение.Период = Дата;
	Движение.Женщина = Женщина;
	Движение.ВидСвязи = ВидСвязи;
	Движение.Мужчина = Мужчина;

	// регистр ЛюбовьДляМужчины
	Движения.ЛюбовьДляМужчины.Записывать = Истина;
	Движение = Движения.ЛюбовьДляМужчины.Добавить();
	Движение.Период = Дата;
	Движение.Мужчина = Мужчина;
	Движение.ВидСвязи = ВидСвязи;
	Движение.Женщина = Женщина;
	
КонецПроцедуры
